<a href="https://colab.research.google.com/github/Dwayne-tech/DML/blob/main/Dwayne_Data_Query_Language.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
%load_ext sql
%sql sqlite:///chinook.db

In [ ]:
%%sql
CREATE TABLE Products (
  ProductID INT PRIMARY KEY,
  ProductName VARCHAR(20) NOT NULL,
  ProductType VARCHAR(20) NOT NULL,
  Price DECIMAL(10, 2) NOT NULL
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE Customers (
  CustomerID INT PRIMARY KEY,
  CustomerName VARCHAR(20) NOT NULL,
  Email VARCHAR(50) NOT NULL,
  Phone VARCHAR(20) NOT NULL
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE Orders (
  OrderID INT PRIMARY KEY,
  CustomerID INT NOT NULL,
  OrderDate DATE NOT NULL,
  FOREIGN KEY (CustomerID) REFERENCES Customers(CustomerID)
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE OrderDetails (
  OrderDetailID INT PRIMARY KEY,
  OrderID INT NOT NULL,
  ProductID INT NOT NULL,
  Quantity INT NOT NULL,
  FOREIGN KEY (OrderID) REFERENCES Orders(OrderID),
  FOREIGN KEY (ProductID) REFERENCES Products(ProductID)
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE ProductTypes (
  ProductTypeID INT PRIMARY KEY,
  ProductTypeName VARCHAR(255) NOT NULL
);

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
INSERT INTO Products (ProductID, ProductName, ProductType, Price)
VALUES
  (1, 'Widget A', 'Widget', 10.00),
  (2, 'Widget B', 'Widget', 15.00),
  (3, 'Gadget X', 'Gadget', 20.00),
  (4, 'Gadget Y', 'Gadget', 25.00),
  (5, 'Doohickey Z', 'Doohickey', 30.00);

 * sqlite:///chinook.db
5 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Customers (CustomerID, CustomerName, Email, Phone)
VALUES
  (1, 'John Smith', 'john@example.com', '123-456-7890'),
  (2, 'Jane Doe', 'jane.doe@example.com', '987-654-3210'),
  (3, 'Alice Brown', 'alice.brown@example.com', '456-789-0123');

 * sqlite:///chinook.db
3 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Orders (OrderID, CustomerID, OrderDate)
VALUES
  (101, 1, '2024-05-01'),
  (102, 2, '2024-05-02'),
  (103, 3, '2024-05-01');

 * sqlite:///chinook.db
3 rows affected.

[]

In [ ]:
%%sql
INSERT INTO OrderDetails (OrderDetailID, OrderID, ProductID, Quantity)
VALUES
  (1, 101, 1, 2),
  (2, 101, 3, 1),
  (3, 102, 2, 3),
  (4, 102, 4, 2),
  (5, 103, 5, 1);

 * sqlite:///chinook.db
5 rows affected.

[]

In [ ]:
%%sql
INSERT INTO ProductTypes (ProductTypeID, ProductTypeName)
VALUES
  (1, 'Widget'),
  (2, 'Gadget'),
  (3, 'Doohickey');

 * sqlite:///chinook.db
3 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Products;

 * sqlite:///chinook.db
Done.

[(1, 'Widget A', 'Widget', 10),
 (2, 'Widget B', 'Widget', 15),
 (3, 'Gadget X', 'Gadget', 20),
 (4, 'Gadget Y', 'Gadget', 25),
 (5, 'Doohickey Z', 'Doohickey', 30)]

In [ ]:
%%sql
SELECT * FROM Customers;

 * sqlite:///chinook.db
Done.

[(1, 'John Smith', 'john@example.com', '123-456-7890'),
 (2, 'Jane Doe', 'jane.doe@example.com', '987-654-3210'),
 (3, 'Alice Brown', 'alice.brown@example.com', '456-789-0123')]

In [ ]:
%%sql
SELECT * FROM Orders;

 * sqlite:///chinook.db
Done.

[(101, 1, '2024-05-01'), (102, 2, '2024-05-02'), (103, 3, '2024-05-01')]

In [ ]:
%%sql
SELECT * FROM OrderDetails;

 * sqlite:///chinook.db
Done.

[(1, 101, 1, 2),
 (2, 101, 3, 1),
 (3, 102, 2, 3),
 (4, 102, 4, 2),
 (5, 103, 5, 1)]

In [ ]:
%%sql
SELECT * FROM ProductTypes;

 * sqlite:///chinook.db
Done.

[(1, 'Widget'), (2, 'Gadget'), (3, 'Doohickey')]

In [ ]:
%%sql
SELECT Products.ProductName, SUM(OrderDetails.Quantity) AS TotalQuantity
FROM Products
JOIN OrderDetails ON Products.ProductID = OrderDetails.ProductID
GROUP BY Products.ProductName;

 * sqlite:///chinook.db
Done.

[('Doohickey Z', 1),
 ('Gadget X', 1),
 ('Gadget Y', 2),
 ('Widget A', 2),
 ('Widget B', 3)]

In [ ]:
%%sql
SELECT Customers.CustomerName, COUNT(Orders.OrderID) AS TotalOrders
FROM Orders
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
GROUP BY Customers.CustomerName
HAVING COUNT(DISTINCT Orders.OrderDate) = 3;

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
SELECT Customers.CustomerName, COUNT(Orders.OrderID) AS TotalOrders
FROM Orders
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
GROUP BY Customers.CustomerName
ORDER BY TotalOrders DESC
LIMIT 1;

 * sqlite:///chinook.db
Done.

[('John Smith', 1)]

In [ ]:
%%sql
SELECT Products.ProductName, SUM(OrderDetails.Quantity) AS TotalQuantity
FROM OrderDetails
JOIN Products ON OrderDetails.ProductID = Products.ProductID
GROUP BY Products.ProductName
ORDER BY TotalQuantity DESC;

 * sqlite:///chinook.db
Done.

[('Widget B', 3),
 ('Widget A', 2),
 ('Gadget Y', 2),
 ('Gadget X', 1),
 ('Doohickey Z', 1)]

In [ ]:
%%sql
SELECT DISTINCT Customers.CustomerName
FROM Orders
JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
JOIN Products ON OrderDetails.ProductID = Products.ProductID
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE Products.ProductType = 'Widget';

 * sqlite:///chinook.db
Done.

[('John Smith',), ('Jane Doe',)]

In [ ]:
%%sql
SELECT Customers.CustomerName,
       SUM(CASE WHEN Products.ProductType = 'Widget' THEN OrderDetails.Quantity * Products.Price ELSE 0 END) AS TotalWidgetCost,
       SUM(CASE WHEN Products.ProductType = 'Gadget' THEN OrderDetails.Quantity * Products.Price ELSE 0 END) AS TotalGadgetCost
FROM Orders
JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
JOIN Products ON OrderDetails.ProductID = Products.ProductID
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE Products.ProductType IN ('Widget', 'Gadget')
GROUP BY Customers.CustomerName
HAVING SUM(CASE WHEN Products.ProductType = 'Widget' THEN OrderDetails.Quantity ELSE 0 END) > 0
   AND SUM(CASE WHEN Products.ProductType = 'Gadget' THEN OrderDetails.Quantity ELSE 0 END) > 0;

 * sqlite:///chinook.db
Done.

[('Jane Doe', 45, 50), ('John Smith', 20, 20)]

In [ ]:
%%sql
SELECT Customers.CustomerName,
       SUM(OrderDetails.Quantity * Products.Price) AS TotalGadgetCost
FROM Orders
JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
JOIN Products ON OrderDetails.ProductID = Products.ProductID
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE Products.ProductType = 'Gadget'
GROUP BY Customers.CustomerName;

 * sqlite:///chinook.db
Done.

[('Jane Doe', 50), ('John Smith', 20)]

In [ ]:
%%sql
SELECT Customers.CustomerName,
       SUM(OrderDetails.Quantity * Products.Price) AS TotalDoohickeyCost
FROM Orders
JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
JOIN Products ON OrderDetails.ProductID = Products.ProductID
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
WHERE Products.ProductType = 'Doohickey'
GROUP BY Customers.CustomerName;

 * sqlite:///chinook.db
Done.

[('Alice Brown', 30)]

In [ ]:
%%sql
SELECT Customers.CustomerName, COUNT(Orders.OrderID) AS TotalOrders
FROM Orders
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
GROUP BY Customers.CustomerName
HAVING COUNT(DISTINCT Orders.OrderDate) = 7;

 * sqlite:///chinook.db
Done.

[]

In [ ]:
%%sql
SELECT Customers.CustomerName,
       SUM(CASE WHEN Products.ProductType = 'Widget' THEN OrderDetails.Quantity ELSE 0 END) AS TotalWidgetsOrdered,
       SUM(CASE WHEN Products.ProductType = 'Gadget' THEN OrderDetails.Quantity ELSE 0 END) AS TotalGadgetsOrdered,
       SUM(OrderDetails.Quantity * Products.Price) AS TotalOrderCost
FROM Orders
JOIN OrderDetails ON Orders.OrderID = OrderDetails.OrderID
JOIN Products ON OrderDetails.ProductID = Products.ProductID
JOIN Customers ON Orders.CustomerID = Customers.CustomerID
GROUP BY Customers.CustomerName;

 * sqlite:///chinook.db
Done.

[('Alice Brown', 0, 0, 30), ('Jane Doe', 3, 2, 95), ('John Smith', 2, 1, 40)]